# -*- coding:utf-8 -*-
#
# 작성자 : 김승언
# 
# 용도 : 설정 모듈
# 설명 : 프레임워크 동작에 필요한 정책 설정 파일
#
# 개발 Log
# 2018.08.06    버전 0.0.5      [개발] 프로토타입 변경
# 2018.08.07    버전 0.0.6      [개발] 설정 정보 추가 및 변경 
# 2018.09.12    버전 0.0.7      [개발] malwares.com 설정 항목
# 2018.09.12    버전 0.0.8      [추가] ELF 포멧 설정 정보

__version__ = "0.0.8"
__author__ = "amanaksu@gmail.com"


#########################################################################################################
# 로그 설정정보
# - log_cmd 는 로그 정보 화면 출력여부를 결정하는 Bool형 Flag (True : 화면 출력, False : 파일 출력)
#########################################################################################################
log_level       = "debug"
log_path        = r""
log_cmd         = True


#########################################################################################################
# 프로세스 설정정보
# - proc_num 는 멀티프로세스 생성 개수
# - queue_size 는 proc_num 의 2배로 설정
# - queue_wait 는 queue가 Empty 상태일 때 다시 queue 상태를 확인할 때까지의 대기 시간 (second 단위)
#########################################################################################################
proc_num        = 5
queue_size      = proc_num * 2
queue_wait      = 1

#########################################################################################################
# 분석 우선순위 레벨 정의 
#########################################################################################################
PRIORITY_LEVEL = {
    "LEVEL_EMERGENCE" : 100000,
    "LEVEL_HIGH"      : 1000,
    "LEVEL_NORMAL"    : 100,
    "LEVEL_LOW"       : 0
}

#########################################################################################################
# 분석 설정 정보
# - recursive 는 Recursive 처리 여부
# - depth 는 Recursive 처리 레벨
# - inherit_root 는 yara를 통해 파일 포멧이 식별되지 않은 경우 Root 파일 포멧 의존성 설정
#########################################################################################################
recursive       = True
depth           = 2
inherit_root    = True
default_priority = PRIORITY_LEVEL.get("LEVEL_NORMAL", 0)

#########################################################################################################
# 필터 설정 정보
# - filter_size_min 는 분석에서 제외할 파일의 최소 크기로 Byte 단위임.
# - filter_size_max 는 분석에서 제외할 파일의 최대 크기로 Byte 단위임.
#   단, filter_size_min, filter_size_max가 모두 0인 경우 적용 제외됨
# - filter_format 은 분석에서 제외할 파일 포멧. 
#########################################################################################################
filter_size_min = 0
filter_size_max = 0
filter_format   = []
 
#########################################################################################################
# Yara 설정 정보
# - support_min_ver 는 Yara 모듈이 지원하는 최소 버전
# - support_max_ver 는 Yara 모듈이 지원하는 최대 버전
#########################################################################################################
support_min_ver = 2.7
support_max_ver = 3.5

#########################################################################################################
# 포멧 엔진 설정 정보
# - priority_eng 는 포멧 엔진을 로드할 때 우선순위 항목으로 Yara 룰, fformat 정보와 연관됨.
# - engine_class 는 포멧 엔진에서 로드할 분석 클래스명
#########################################################################################################
priority_eng    =["scan_module", "file_type", "name"]
engine_class    ="KeiEngine"

#########################################################################################################
# 분석 큐 모니터링 설정
# :: temp_path 로 지정된 경로내에 큐잉용 폴더를 생성해 파일의 처리 상태를 모니터링할 수 있도록 한다. 
#       * <임시폴더>\\waiting   : 분석대기 --> scanObject 생성 완료 시점.
#       * <임시폴더>\\except    : 예외     --> dispatch() 내 DispatchPassThru 예외가 발생한 시점.
#       * <임시폴더>\\analyzing : 분석중   --> _run_module() 에서 실행된 하위 프로세스 (분석 엔진) 전달 시점.
#       * <임시폴더>\\complete  : 분석완료 --> dispatch() 내 get_result() 확인 시점.
#       * <임시폴더>\\error     : 에러     --> dispatch() 내 get_result() 확인 시점.
#       * <임시폴더>\\embedding : 임베딩   --> 
# - queue_monitor 는 큐잉용 폴더를 사용할지 여부를 결정한다. 
#########################################################################################################
queue_monitor   = True
dir_q_monitor   = {
#   내부에서 사용하는 키     파일을 저장할 폴더명    
    "waiting"           :   "waiting",
    "analyzing"         :   "analyzing",
    "except"            :   "except",
    "complete"          :   "complete",
    "error"             :   "error",
    "embedding"         :   "embedding"
}

#########################################################################################################
# 임베딩 파일 설정 정보
#########################################################################################################
extend_seperate = "_"
extend          = "dmp"

#########################################################################################################
# 저장 설정 정보
# - temp_path 는 임시 파일, 임베딩 파일 등을 생성/저장하는 폴더 
# - clear_temp 는 임시 폴더 내 dir_q_monitor 폴더를 제외한 파일 삭제 여부. 
# - clear_q_monitor 는 임시 폴더 내 큐 모니터용 폴더 삭제 여부 
#########################################################################################################
temp_path       = r""
clear_temp      = True
clear_q_monitor = False

#########################################################################################################
# malwares.com 정보 
# - mws_flag 는 malwares.com 연동 기능 활성화 여부
# - mws_key 는 malwares.com 연동시 사용할 개인키 
#########################################################################################################
mws_flag        = False
mws_key         = ""
mws_save_folder = "malwares"

#########################################################################################################
# Yara 룰셋 
# - format_rules 는 포멧 분류를 위한 Yara 룰 폴더 또는 파일 
#########################################################################################################
format_rules    = r""
exploit_rules   = r""

#########################################################################################################
# OLE 계열 파일 설정 정보
# - ole_reference 는 하위 Stream 분석 과정에서 참조하는 Stream을 선정의
# - ole_eng_path 는 OLE 계열 파일 엔진 경로
#########################################################################################################
ole_reference   = ["1Table", "0Table", "FileHeader"]
ole_eng_path    = "CompoundFileBinaryFormat"

#########################################################################################################
# ELF 
#########################################################################################################
elf_exploit_flag = True